Documents/ВозвратПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВозвратПоставщику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.Поставки</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.Возвраты</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
				<xr:Item>AccumulationRegister.ПлатежныйКалендарьЗакупки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_АвтоматическийПоиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВозвратПоставщику/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ДействияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;
	
	Если гоНПЗ(Параметры.ЗначениеКопирования) Тогда Сообщить("Копирование возвратов поставщикам запрещено!"); Отказ = Истина; Возврат; КонецЕсли; 
	
	РежимЗаписиПроведение = Новый Структура ("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	Избранный = гоИзбранный(Объект.Ссылка);
	
	ЧислоЗнаковКоличество = Объект.Фирма.ЧислоЗнаковКоличество;
	ЧислоЗнаковЦенаЗакупки = Объект.Фирма.ЧислоЗнаковЦенаЗакупки;
	
	Элементы.ТоварыКоличество.Формат = "ЧДЦ=" + ЧислоЗнаковКоличество;
	Элементы.ТоварыЦенаЗакупки.Формат = "ЧДЦ=" + ЧислоЗнаковЦенаЗакупки;
	Элементы.ТоварыНоменклатураРодитель.Видимость = Объект.Фирма.ВыводитьГруппа;
	Элементы.ТоварыНоменклатураПроизводитель.Видимость = Объект.Фирма.ВыводитьПроизводитель;
	Элементы.ТоварыСерия.Видимость = Объект.Фирма.ВыводитьСерия;
	Элементы.ТоварыПартияСрокГодности.Видимость = Объект.Фирма.ВыводитьСрокГодности;
	
	Элементы.ТоварыУдалитьВсе.Видимость = Истина;
	
	Попытка
		Элементы.ФормаИзменитьФорму.Видимость = Ложь;
	Исключение
	КонецПопытки; 
	
	//2017.03.24
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() <> 0 Тогда
	Если Мас.Найти(Объект.Склад) = Неопределено Тогда Отказ = Истина; Возврат; КонецЕсли; КонецЕсли;  
	
	// © Primus1C  27.12.2023  НАЧАЛО ►
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента);  

	Элементы.Валюта.БыстрыйВыбор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 
	ЗаполнитьКэшДанных();

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Валюта 	= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Валюта");
		Объект.Склад 	= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Склад");
	КонецЕсли;	
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	
	ТолПро = ЭтаФорма.ТолькоПросмотр;
	
	ЕстьОплата = Ложь;
	//2016.08.26
	//этоЧужой = Ложь;
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		ЕстьОплата = омСервер.ЕстьОплатаДокумента(Объект.Ссылка); 
		//2016.08.26
		//этоЧужой = гоЧужойДокумент(Объект.КемСоздан);
	КонецЕсли; 
	
	//2016.08.26 + ИЛИ этоЧужой
	Если Избранный ИЛИ ЕстьОплата ИЛИ (Объект.СуммаПривязано <> 0) 
		//ИЛИ этоЧужой 
		Тогда ТолПро = Истина КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = ТолПро;
	
	стрПросмотр = клПросмотр(ЭтаФорма, Избранный, Объект.Ссылка);
	
	УстановитьВидимостьДоступность();
	МоиИтоги();
	
	РаботаСоСканеромШК.СканерШКПодключить(); 
	
	// © Primus1C  27.12.2023  НАЧАЛО ►
	ОтобразитьЦветВалюты();
	// © Primus1C  ОКОНЧАНИЕ ◄
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	клФормаДокументаПередЗаписью(Объект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимостьДоступность();
	МоиОстатки();
	МоиИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	//2016.02.08
	Если НЕ (ЭтаФорма.Окно = АктивноеОкно()) Тогда Возврат КонецЕсли; 
	
	ШК = "";
	Если РаботаСоСканеромШК.СканерШКНачатьОбработку(Источник, Событие, Данные, ШК) Тогда  
		ЛюбаяСерия(ШК);
		РаботаСоСканеромШК.СканерШКЗавершитьОбработку();
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура МоиИтоги()    
	// © Primus1C  02.12.2023  НАЧАЛО ►
	//стрИтого = "";
	//стрОплата = "";
	//омСервер.МоиИтоги(Объект, стрИтого, стрОплата);
	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект); 
	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

&НаКлиенте
Процедура МоиОстатки()
	стрОстатки = "?";
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	стрОстатки = омСервер.МоиОстатки(Объект.Ссылка, Стр.Номенклатура, Стр.Партия);
КонецПроцедуры

&НаКлиенте
Процедура МояЗаписать(ПроверятьМодифицированность = Истина)
	УстановитьВидимостьДоступность();
	
	Если ПроверятьМодифицированность Тогда
		Если НЕ Модифицированность Тогда Возврат КонецЕсли; КонецЕсли; 
		
	Записать(РежимЗаписиПроведение);
	МоиОстатки();
	МоиИтоги();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	НетСтрок = Объект.Товары.Количество() = 0;
	ЕстьСтроки = НЕ НетСтрок;
	
	Закрыто = Объект.Окончательно;	
	НеЗакрыто = НЕ Закрыто;
	
	Элементы.Дата.ТолькоПросмотр = Закрыто;
	Элементы.Склад.ТолькоПросмотр = ЕстьСтроки ИЛИ Закрыто;
	Элементы.Валюта.ТолькоПросмотр = ЕстьСтроки ИЛИ Закрыто;
	Элементы.Установить.Доступность = НеЗакрыто;
	Элементы.Снять.Доступность = Закрыто;
	Элементы.Контрагент.ТолькоПросмотр = Закрыто ИЛИ ЕстьСтроки;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	МоиОстатки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	МоеДобавление();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	МоеРедактирование(СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "Товары", ""));
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	МоеУдаление();
КонецПроцедуры


&НаКлиенте
Процедура МоеДобавление()
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Warehouse not specified!'")); Возврат; КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	Если гоПЗ(Объект.Контрагент) Тогда клОшибка("Не задан поставщик!"); Возврат; КонецЕсли; 
	
	Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	Попытка
		НовНом = Элементы.Товары.ТекущиеДанные.Номенклатура;
		НовПар = Элементы.Товары.ТекущиеДанные.Партия;
	Исключение 
		НовНом = гоПустой("Номенклатура");
		НовПар = гоПустой("Партии");
	КонецПопытки;
	
	МоеДобавлениеШаг(НовНом);
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеШаг(НовНом)
	гоУстановитьПараметрСеанса("Склад", Объект.Склад);
	ПоказатьВводЗначения(Новый ОписаниеОповещения("МоеДобавлениеПослеВыбораНоменклатуры", ЭтотОбъект), НовНом, "Выберите номенклатуру");
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеВыбораНоменклатуры(НовНом, ДопПараметры) Экспорт
	Если НовНом = Неопределено Тогда Возврат КонецЕсли; 
	
	гоУстановитьПараметрСеанса("Склад", Объект.Склад);
	гоУстановитьПараметрСеанса("Номенклатура", НовНом);
	
	гоУстановитьПараметрСеанса("ВалютаВыбора", Объект.Валюта);
	гоУстановитьПараметрСеанса("ПоставщикВыбора", Объект.Контрагент);
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("МоеДобавлениеПослеВыбораПартии", ЭтотОбъект, НовНом), НовПар, НСтр("ru = 'Выберите партию'; en = 'Select batch'"));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеВыбораПартии(НовПар, НовНом) Экспорт
	Если НовПар = Неопределено Тогда 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли; 
	
	//тут работает выбор нормально, получим остаток партии, вдруг выбрали без остатка
	ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, НовПар);
	Если ОстПар <= 0 Тогда 
		клОшибка("Нет остатка у выбранной партии!"); 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли; 
	
	Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Партия", НовПар));
	Если НЕ (Нашли.Количество() = 0) Тогда 
		клОшибка(гоИмя(НовПар) + ": уже есть в документе!" + гоРС() + "Используйте редактирование количества!!!"); 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли;
	
	Пар = Новый Структура;
	Пар.Вставить("Фирма", Объект.Фирма);
	Пар.Вставить("Номенклатура", НовНом);
	Пар.Вставить("Количество", ОстПар);
	Пар.Вставить("Склад", Объект.Склад);
	Пар.Вставить("Партия", НовПар);
	
	ОткрытьФорму("ОбщаяФорма.ВводСтрокиПМ", Пар, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("МоеДобавлениеПослеВводаСтроки", ЭтотОбъект, Новый Структура("НовНом,НовПар", НовНом, НовПар)));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеВводаСтроки(Пар, Параметры) Экспорт
	НовНом = Параметры.НовНом;
	НовПар = Параметры.НовПар;
	
	Если гоПЗ(Пар) Тогда 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли; 
	
	НовКол = Пар.Количество;
	Если НовКол = 0 Тогда 
		клОшибка(НСтр("ru = 'Не введено количество!'; en = 'Quantity not entered!'")); 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли;
	
	клСохранитьИзменения(Новый ОписаниеОповещения("МоеДобавлениеПослеПодтверждения", ЭтотОбъект, 
		Новый Структура("НовНом,НовПар,НовКол", НовНом, НовПар, НовКол)));
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавлениеПослеПодтверждения(Результат, Параметры) Экспорт
	НовНом = Параметры.НовНом;
	НовПар = Параметры.НовПар;
	НовКол = Параметры.НовКол;
	
	Если НЕ Результат Тогда 
		МоеДобавлениеШаг(НовНом); 
		Возврат; 
	КонецЕсли;
	
	ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, НовПар);
	Если НовКол > ОстПар Тогда 
		клОшибка("Не хватило остатка " + Строка(НовКол - ОстПар) + " для " + гоИмя(НовПар) + ", исправлено на " + ОстПар + "!");
		НовКол = ОстПар;
	КонецЕсли;
	
	НовСтр = Объект.Товары.Добавить();
	
	НовСтр.Номенклатура = НовНом;
	НовСтр.Партия = НовПар;
	НовСтр.Количество = НовКол;
	
	ИДИ = НовСтр.ПолучитьИдентификатор();
	
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации(Строка(НовКол) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	
	Элементы.Товары.ТекущаяСтрока = ИДИ;
	
	МоеДобавлениеШаг(НовНом);
КонецПроцедуры


&НаКлиенте
Процедура ЛюбаяСерия(ШК)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если гоПЗ(Объект.Склад) Тогда клОшибка("Не задан склад!"); Возврат; КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда клОшибка("Не задана валюта!"); Возврат; КонецЕсли; 
	Если гоПЗ(Объект.Контрагент) Тогда клОшибка("Не задан поставщик!"); Возврат; КонецЕсли; 
	
	Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	//по идее, нужно найти товар с такой серией и передать его в добавление строки, зачем изобретать велосипед?
	СпиПар = омСервер.ПартииПоСерииОстатки(ШК, Объект.Фирма, Объект.Склад);
	
	Ско = СпиПар.Количество();
	Если Ско  = 0 Тогда
		Сигнал();
		клОшибка("Нет остатков по серии: " + ШК + "!");
		Возврат;
	ИначеЕсли Ско > 1 Тогда
		Сигнал();
		СпиПар.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ЛюбаяСерияПослеВыбораПартии", ЭтотОбъект, ШК), 
			"Найдено несколько партий с такой серией, выберите:");
		Возврат;
	КонецЕсли; 
	
	ЛюбаяСерияПродолжение(СпиПар[0].Значение, ШК);
КонецПроцедуры

&НаКлиенте
Процедура ЛюбаяСерияПослеВыбораПартии(Эле, ШК) Экспорт
	Если Эле = Неопределено Тогда Возврат КонецЕсли;
	ЛюбаяСерияПродолжение(Эле.Значение, ШК);
КонецПроцедуры

&НаКлиенте
Процедура ЛюбаяСерияПродолжение(ТекПар, ШК)
	Если ТекПар = 0 Тогда Возврат КонецЕсли; 
	
	НовКол = 1;
	НовНом = гоРеквизит(ТекПар, "Владелец");
	
	//проверить валюту и поставщика нужно
	НовПос = гоРеквизит(ТекПар, "Контрагент");
	НовВал = гоРеквизит(ТекПар, "Валюта");
	
	Если НовПос <> Объект.Контрагент Тогда клОшибка("Не тот поставщик: " + гоИмя(НовПос) + "!"); Возврат; КонецЕсли; 
	Если НовВал <> Объект.Валюта Тогда клОшибка("Не та валюта: " + гоИмя(НовВал) + "!"); Возврат; КонецЕсли;
	
	НовСтр = Объект.Товары.Добавить();
	
	НовСтр.Номенклатура = НовНом;
	НовСтр.Партия = ТекПар;
	НовСтр.Количество = НовКол;
	
	ИДИ = НовСтр.ПолучитьИдентификатор();
	
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации(ШК + "|" + Строка(НовКол) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	
	Элементы.Товары.ТекущаяСтрока = ИДИ;
КонецПроцедуры


&НаКлиенте
Процедура МоеРедактирование(Кол)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	ИДИ = Элементы.Товары.ТекущаяСтрока;
	
	Если Кол = "Количество" Тогда
		БылКол = Стр.Количество;
		НовКол = БылКол;
		
		ПоказатьВводЧисла(Новый ОписаниеОповещения("МоеРедактированиеПослеВводаКоличества", ЭтотОбъект, Новый Структура("ИДИ,БылКол", ИДИ, БылКол)), НовКол, "Введите количество", 14, ЧислоЗнаковКоличество);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактированиеПослеВводаКоличества(НовКол, Параметры) Экспорт
	Если НовКол = Неопределено Тогда Возврат КонецЕсли;
	
	ИДИ = Параметры.ИДИ;
	БылКол = Параметры.БылКол;
	Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	ОстПар = омСервер.ОстатокПартии(Объект.Фирма, Объект.Склад, Стр.Партия);
	Если Объект.Проведен Тогда ОстПар = ОстПар + БылКол КонецЕсли;
	
	Если НовКол > ОстПар Тогда 
		клОшибка("Не хватило остатка " + Строка(НовКол - ОстПар) + " для " + гоИмя(Стр.Партия) + ", исправлено на " + ОстПар + "!");
		НовКол = ОстПар;
	КонецЕсли;
	Если НовКол = Стр.Количество Тогда Возврат КонецЕсли;
	
	Стр.Количество = НовКол;
	
	МояЗаписать(Ложь);
	
	Колич = НовКол;
	Номен = Стр.Номенклатура;
	СЦена = Стр.ЦенаЗакупки;
	
	гоЗаписьЖурналаРегистрации(Строка(БылКол) + "->" + Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(Объект.Ссылка, Ложь), ИмяДокумента, "Редактирование количества", Номен, 2);
	гоЗаписьЖурналаРегистрации(Строка(БылКол) + "->" + Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(Номен, Ложь), ИмяДокумента, "Редактирование количества", Объект.Ссылка, 2);
КонецПроцедуры


&НаКлиенте
Процедура МоеУдаление()
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда 
		Если гоАдминистратор() Тогда 
			Сообщить("Под ответственность Администратора!");
		Иначе 
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	ИДИ = Элементы.Товары.ТекущаяСтрока;
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	клНетДа(Новый ОписаниеОповещения("МоеУдалениеЗавершение", ЭтотОбъект, ИДИ),
		"Удалить строку?");
КонецПроцедуры

&НаКлиенте
Процедура МоеУдалениеЗавершение(Результат, ИДИ) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Удаляем = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Удаляем = Неопределено Тогда клОшибка("Странно, не нашли текущую строку!"); Возврат; КонецЕсли; 
	
	Номен = Удаляем.Номенклатура;
	СЦена = Удаляем.ЦенаЗакупки;
	Колич = Удаляем.Количество;
	
	Объект.Товары.Удалить(Удаляем);
	
	гоЗаписьЖурналаРегистрации(Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(Номен, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Удаление строки", Объект.Ссылка, 2);
	
	//партия сама пометится на удаление при записи
	МояЗаписать(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если гоПЗ(Объект.Контрагент) Тогда Возврат КонецЕсли;
	Если омСервер.ЕстьНезакрытыеДокументы(Объект.Контрагент, Объект.Ссылка) Тогда клВнимание("ВНИМАНИЕ! Есть незакрытые документы!!!") КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Товары.Количество() = 0 Тогда 
		клНамекнуть(ИмяДокумента, НСтр("ru = 'Документ пуст!'; en = 'The document is empty!'"), БиблиотекаКартинок.ПоискДанных);
		Возврат;
	КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("УстановитьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Установить флаг <Окончательно>?'; en = 'Set flag <Finaly>?'"));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Истина;
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации("Установили", ИмяДокумента, "Установка {Окончательно}", Объект.Ссылка, 2);
КонецПроцедуры

&НаКлиенте
Процедура Снять(Команда)
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	клНетДа(Новый ОписаниеОповещения("СнятьПослеПодтверждения", ЭтотОбъект), "Снять флаг {Окончательно}?");
КонецПроцедуры

&НаКлиенте
Процедура СнятьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Ложь;
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);
КонецПроцедуры


&НаКлиенте
Процедура УдалитьВсе(Команда)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	клНетДа(Новый ОписаниеОповещения("УдалитьВсеЗавершение", ЭтотОбъект), "Удалить все строки?");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеЗавершение(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Товары.Очистить();
	
	МояЗаписать(Ложь);
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьПривязки(Откуда)
	локПривязки = ЗначениеИзСтрокиВнутр(Откуда);
	
	Если Объект.Привязки.Количество() <> 0 Тогда Объект.Привязки.Очистить() КонецЕсли; 
	
	Для Каждого Стр Из локПривязки Цикл
		Если Стр.СуммаДокумента = 0 Тогда Продолжить КонецЕсли;
		
		Нов = Объект.Привязки.Добавить();
		
		Нов.Сумма1 = Стр.СуммаДокумента;
		Нов.Валюта1 = Стр.ВалютаДокумента;
		Нов.Сумма2 = Стр.СуммаДолга;
		Нов.Валюта2 = Стр.ВалютаДолга;
		Нов.КроссКурс = Стр.КроссКурс;
		Нов.ОбратныйКурс = Стр.ОбратныйКурс;
		Нов.Док2 = Стр.Док;
		Нов.Примечание = Стр.Примечание;
		Нов.ЭтоПредоплата = Стр.ЭтоПредоплата;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура МоиПривязки()
	Если гоПЗ(Объект.Контрагент) Тогда Возврат КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда Возврат КонецЕсли; 
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	//2016.08.26
	//Если гоЧужойДокумент(Объект.КемСоздан) Тогда Возврат КонецЕсли; 
	
	лПривязать = Объект.Сумма;
	Если лПривязать = 0 Тогда Возврат КонецЕсли; 
	
	МояЗаписать(Ложь);
	
	Если НЕ Объект.Проведен Тогда клОшибка("Документ не проведен!"); Возврат; КонецЕсли;
	
	Пар = Новый Структура("Док, Привязки, ТолькоПривязки", Объект.Ссылка, Объект.Привязки, 0);
	
	ОткрытьФорму("Обработка.ПривязкаДолгов.Форма.Форма", Пар, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("МоиПривязкиЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура МоиПривязкиЗавершение(Рез, ДопПараметры) Экспорт
	Если Рез = Неопределено Тогда Возврат КонецЕсли; 
	
	СохМасПривязки = клПривязкиВМассив(Объект);
	ЗаполнитьПривязки(Рез.ПривязкиСтрока);
	МояЗаписать(Ложь);
	клОповеститьПривязки(Объект, СохМасПривязки);
КонецПроцедуры


&НаКлиенте
Процедура ОплатыЗачет(Команда)
	МоиПривязки();
КонецПроцедуры


&НаКлиенте
Процедура ИскатьКонтрагента(Команда)
//2016.06.09

	клИскатьКонтрагента(Новый ОписаниеОповещения("ИскатьКонтрагентаЗавершение", ЭтотОбъект), Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ИскатьКонтрагентаЗавершение(НовКон, ДопПараметры) Экспорт
	Если НовКон = Неопределено Тогда Возврат КонецЕсли; 
	Объект.Контрагент = новКон;
КонецПроцедуры


&НаКлиенте
Процедура РучнойШКПриИзменении(Элемент)
	
	//ЛюбаяСерия(РучнойШК);
	
	Если Не Объект.ВКД_АвтоматическийПоиск Тогда 
		ЛюбаяСерия(РучнойШК);
	Иначе
	 ВКД_ЗаполнитьПоСерии(РучнойШК);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВКД_ЗаполнитьПоСерии(Серия)
		
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ОстаткиТовараОстатки.Склад,
	              |	ОстаткиТовараОстатки.Номенклатура,
	              |	ОстаткиТовараОстатки.Партия,
	              |	ОстаткиТовараОстатки.Партия.Серия КАК Серия,
	              |	ОстаткиТовараОстатки.Партия.Контрагент КАК Поставщик,
	              |	ОстаткиТовараОстатки.Партия.Валюта КАК Валюта,
	              |	ВЫБОР
	              |		КОГДА ОстаткиТовараОстатки.Партия.ВКД_ЦенаСоСкидкой = 0
	              |			ТОГДА ОстаткиТовараОстатки.Партия.ЦенаЗакупки
	              |		ИНАЧЕ ОстаткиТовараОстатки.Партия.ВКД_ЦенаСоСкидкой
	              |	КОНЕЦ КАК ЦенаЗакупки
	              |ИЗ
	              |	РегистрНакопления.ОстаткиТовара.Остатки(, Партия.Серия = &Серия) КАК ОстаткиТовараОстатки" ;
	
	Запрос.УстановитьПараметр("Серия",Серия);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден товар с этой серией!" ;
		Сообщение.Сообщить();
	ИначеЕсли Выборка.Количество() > 1 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Найдено несколько товаров с этой серией! Автопоиск отключен!";
        Сообщение.Сообщить();
		Объект.ВКД_АвтоматическийПоиск = Ложь;
		Возврат;
	Иначе
		Выборка.Следующий();
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.Контрагент = Выборка.Поставщик;
	ИначеЕсли ЗначениеЗаполнено(Объект.Контрагент) И Объект.Контрагент <> Выборка.Поставщик Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Эта номенклатура поставлена другим поставщиком! Необходимо создать другой документ!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
		Объект.Валюта = Выборка.Валюта;
		Объект.Склад = Выборка.Склад;
		Стр = Объект.Товары.Добавить();
		Стр.Номенклатура = Выборка.Номенклатура;
		Стр.Серия = Выборка.Серия;
		Стр.Партия = Выборка.Партия;
		Стр.ЦенаЗакупки = Выборка.ЦенаЗакупки;
		Стр.Количество = 1;
		Стр.СуммаЗакупки = Выборка.ЦенаЗакупки;	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВКД_АвтоматическийПоискПриИзменении(Элемент)
Объект.Валюта =  гоПустой("Валюты");
Объект.Контрагент = гоПустой("Контрагенты");
Объект.Склад =  гоПустой("Склады");
КонецПроцедуры

// © Primus1C  27.12.2023  НАЧАЛО ►

 &НаСервере
 Процедура ЗаполнитьКэшДанных()
	 
	 КэшДанных = Новый Структура;
	 КэшДанных.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	 КэшДанных.Вставить("ЦветаВалют", ОбщегоНазначенияПовтИсп.ЦветаВалют());
	 
 КонецПроцедуры           

&НаКлиенте
 Процедура ВалютаПриИзменении(Элемент)

 	ОтобразитьЦветВалюты();
	 
 КонецПроцедуры
 
Процедура ОтобразитьЦветВалюты() 
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		Элементы.Валюта.ЦветФона 	= КэшДанных.ЦветаВалют.Получить(Объект.Валюта);
		Элементы.Валюта1.ЦветФона 	= КэшДанных.ЦветаВалют.Получить(Объект.Валюта);
	КонецЕсли
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
